ARMmbed/mbed-os/targets/TARGET_NXP/TARGET_MCUXpresso_MCUS/TARGET_MIMXRT1170/drivers/fsl_clock.h
/*! @brief Clock ip name array for MQS. */
#define MQS_CLOCKS \
    {              \
        kCLOCK_Mqs \
    }

/*! @brief Clock ip name array for PDM. */
#define PDM_CLOCKS \
    {              \
        kCLOCK_Pdm \
    }

/*! @brief Clock ip name array for SPDIF. */
#define SPDIF_CLOCKS \
    {                \
        kCLOCK_Spdif \
    }

/*! @brief Clock ip name array for SAI. */
#define SAI_CLOCKS                                              \
    {                                                           \
        kCLOCK_IpInvalid, kCLOCK_Sai1, kCLOCK_Sai2, kCLOCK_Sai3, kCLOCK_Sai4 \
    }

/*! @brief Clock ip name array for PXP. */
#define PXP_CLOCKS \
    {              \
        kCLOCK_Pxp \
    }

/*! @brief Clock ip name array for GPU2d. */
#define GPU2D_CLOCKS \
    {              \
        kCLOCK_Gpu2d \
    }

/*! @brief Clock ip name array for LCDIF. */
#define LCDIF_CLOCKS \
    {                \
        kCLOCK_Lcdif   \
    }

/*! @brief Clock ip name array for LCDIFV2. */
#define LCDIFV2_CLOCKS \
    {                       \
        kCLOCK_Lcdifv2 \
    }

/*! @brief Clock ip name array for MIPI_DSI. */
#define MIPI_DSI_HOST_CLOCKS \
    {                       \
        kCLOCK_Mipi_Dsi \
    }

/*! @brief Clock ip name array for MIPI_CSI. */
#define MIPI_CSI2RX_CLOCKS \
    {                       \
        kCLOCK_Mipi_Csi \
    }

/*! @brief Clock ip name array for CSI. */
#define CSI_CLOCKS \
    {              \
        kCLOCK_Csi \
    }

/*! @brief Clock ip name array for DCIC_MIPI. */
#define DCIC_MIPI_CLOCKS \
    {              \
        kCLOCK_Dcic_Mipi \
    }

/*! @brief Clock ip name array for DCIC_LCD. */
#define DCIC_LCD_CLOCKS \
    {              \
        kCLOCK_Dcic_Lcd \
    }

/*! @brief Clock ip name array for DMAMUX_CLOCKS. */
#define DMAMUX_CLOCKS \
    {                 \
        kCLOCK_Edma, kCLOCK_Edma_Lpsr    \
    }

/*! @brief Clock ip name array for XBARA. */
#define XBARA_CLOCKS \
    {                \
        kCLOCK_Xbar1 \
    }

/*! @brief Clock ip name array for XBARB. */
#define XBARB_CLOCKS                                                   \
    {                                                                  \
        kCLOCK_IpInvalid, kCLOCK_IpInvalid, kCLOCK_Xbar2, kCLOCK_Xbar3 \
    }

/* Clock LPCG index */
typedef enum _clock_lpcg
{
    kCLOCK_M7 = 0,
    kCLOCK_M4 = 1,
    kCLOCK_Sim_M7 = 2,
    kCLOCK_Sim_M = 3,
    kCLOCK_Sim_Disp = 4,
    kCLOCK_Sim_Per = 5,
    kCLOCK_Sim_Lpsr = 6,
    kCLOCK_Anadig = 7,
    kCLOCK_Dcdc = 8,
    kCLOCK_Src = 9,
    kCLOCK_Ccm = 10,
    kCLOCK_Gpc = 11,
    kCLOCK_Ssarc = 12,
    kCLOCK_Sim_R = 13,
    kCLOCK_Wdog1 = 14,
    kCLOCK_Wdog2 = 15,
    kCLOCK_Wdog3 = 16,
    kCLOCK_Wdog4 = 17,
    kCLOCK_Ewm0 = 18,
    kCLOCK_Sema = 19,
    kCLOCK_Mu_A = 20,
    kCLOCK_Mu_B = 21,
    kCLOCK_Edma = 22,
    kCLOCK_Edma_Lpsr = 23,
    kCLOCK_Romcp = 24,
    kCLOCK_Ocram = 25,
    kCLOCK_Flexram = 26,
    kCLOCK_Lmem = 27,
    kCLOCK_Flexspi1 = 28,
    kCLOCK_Flexspi2 = 29,
    kCLOCK_Rdc = 30,
    kCLOCK_M7_Xrdc = 31,
    kCLOCK_M4_Xrdc = 32,
    kCLOCK_Semc = 33,
    kCLOCK_Xecc = 34,
    kCLOCK_Iee = 35,
    kCLOCK_Key_Manager = 36,
    kCLOCK_Puf = 36,
    kCLOCK_Ocotp = 37,
    kCLOCK_Snvs_Hp = 38,
    kCLOCK_Snvs = 39,
    kCLOCK_Caam = 40,
    kCLOCK_Jtag_Mux = 41,
    kCLOCK_Cstrace = 42,
    kCLOCK_Xbar1 = 43,
    kCLOCK_Xbar2 = 44,
    kCLOCK_Xbar3 = 45,
    kCLOCK_Aoi1 = 46,
    kCLOCK_Aoi2 = 47,
    kCLOCK_Adc_Etc = 48,
    kCLOCK_Iomuxc = 49,
    kCLOCK_Iomuxc_Lpsr = 50,
    kCLOCK_Gpio = 51,
    kCLOCK_Kpp = 52,
    kCLOCK_Flexio1 = 53,
    kCLOCK_Flexio2 = 54,
    kCLOCK_Lpadc1 = 55,
    kCLOCK_Lpadc2 = 56,
    kCLOCK_Dac = 57,
    kCLOCK_Acmp1 = 58,
    kCLOCK_Acmp2 = 59,
    kCLOCK_Acmp3 = 60,
    kCLOCK_Acmp4 = 61,
    kCLOCK_Pit1 = 62,
    kCLOCK_Pit2 = 63,
    kCLOCK_Gpt1 = 64,
    kCLOCK_Gpt2 = 65,
    kCLOCK_Gpt3 = 66,
    kCLOCK_Gpt4 = 67,
    kCLOCK_Gpt5 = 68,
    kCLOCK_Gpt6 = 69,
    kCLOCK_Qtimer1 = 70,
    kCLOCK_Qtimer2 = 71,
    kCLOCK_Qtimer3 = 72,
    kCLOCK_Qtimer4 = 73,
    kCLOCK_Enc1 = 74,
    kCLOCK_Enc2 = 75,
    kCLOCK_Enc3 = 76,
    kCLOCK_Enc4 = 77,
    kCLOCK_Hrtimer = 78,
    kCLOCK_Pwm1 = 79,
    kCLOCK_Pwm2 = 80,
    kCLOCK_Pwm3 = 81,
    kCLOCK_Pwm4 = 82,
    kCLOCK_Can1 = 83,
    kCLOCK_Can2 = 84,
    kCLOCK_Can3 = 85,
    kCLOCK_Lpuart1 = 86,
    kCLOCK_Lpuart2 = 87,
    kCLOCK_Lpuart3 = 88,
    kCLOCK_Lpuart4 = 89,
    kCLOCK_Lpuart5 = 90,
    kCLOCK_Lpuart6 = 91,
    kCLOCK_Lpuart7 = 92,
    kCLOCK_Lpuart8 = 93,
    kCLOCK_Lpuart9 = 94,
    kCLOCK_Lpuart10 = 95,
    kCLOCK_Lpuart11 = 96,
    kCLOCK_Lpuart12 = 97,
    kCLOCK_Lpi2c1 = 98,
    kCLOCK_Lpi2c2 = 99,
    kCLOCK_Lpi2c3 = 100,
    kCLOCK_Lpi2c4 = 101,
    kCLOCK_Lpi2c5 = 102,
    kCLOCK_Lpi2c6 = 103,
    kCLOCK_Lpspi1 = 104,
    kCLOCK_Lpspi2 = 105,
    kCLOCK_Lpspi3 = 106,
    kCLOCK_Lpspi4 = 107,
    kCLOCK_Lpspi5 = 108,
    kCLOCK_Lpspi6 = 109,
    kCLOCK_Sim1 = 110,
    kCLOCK_Sim2 = 111,
    kCLOCK_Enet = 112,
    kCLOCK_Enet_1g = 113,
    kCLOCK_Enet_Qos = 114,
    kCLOCK_Usb = 115,
    kCLOCK_Sdio = 116,
    kCLOCK_Usdhc1 = 117,
    kCLOCK_Usdhc2 = 118,
    kCLOCK_Asrc = 119,
    kCLOCK_Mqs = 120,
    kCLOCK_Pdm = 121,
    kCLOCK_Spdif = 122,
    kCLOCK_Sai1 = 123,
    kCLOCK_Sai2 = 124,
    kCLOCK_Sai3 = 125,
    kCLOCK_Sai4 = 126,
    kCLOCK_Pxp = 127,
    kCLOCK_Gpu2d = 128,
    kCLOCK_Lcdif = 129,
    kCLOCK_Lcdifv2 = 130,
    kCLOCK_Mipi_Dsi = 131,
    kCLOCK_Mipi_Csi = 132,
    kCLOCK_Csi = 133,
    kCLOCK_Dcic_Mipi = 134,
    kCLOCK_Dcic_Lcd = 135,
    kCLOCK_Video_Mux = 136,
    kCLOCK_Uniq_Edt_I = 137,

    kCLOCK_IpInvalid,
} clock_lpcg_t;

/* Clock name */
typedef enum _clock_name
{
    kCLOCK_OscRc16M = 0,
    kCLOCK_OscRc48M = 1,
    kCLOCK_OscRc48MDiv2 = 2,
    kCLOCK_OscRc400M = 3,
    kCLOCK_Osc24M = 4,
    kCLOCK_Osc24MOut = 5,
    kCLOCK_ArmPll = 6,
    kCLOCK_ArmPllOut = 7,
    kCLOCK_SysPll2 = 8,
    kCLOCK_SysPll2Out = 9,
    kCLOCK_SysPll2Pfd0 = 10,
    kCLOCK_SysPll2Pfd1 = 11,
    kCLOCK_SysPll2Pfd2 = 12,
    kCLOCK_SysPll2Pfd3 = 13,
    kCLOCK_SysPll3 = 14,
    kCLOCK_SysPll3Out = 15,
    kCLOCK_SysPll3Div2 = 16,
    kCLOCK_SysPll3Pfd0 = 17,
    kCLOCK_SysPll3Pfd1 = 18,
    kCLOCK_SysPll3Pfd2 = 19,
    kCLOCK_SysPll3Pfd3 = 20,
    kCLOCK_SysPll1 = 21,
    kCLOCK_SysPll1Out = 22,
    kCLOCK_SysPll1Div2 = 23,
    kCLOCK_SysPll1Div5 = 24,
    kCLOCK_AudioPll = 25,
    kCLOCK_AudioPllOut = 26,
    kCLOCK_VideoPll = 27,
    kCLOCK_VideoPllOut = 28,
    kCLOCK_CpuClk,
    kCLOCK_CoreSysClk,
} clock_name_t;

/* Clock OBSERVE SIGNALS */
#define CCM_OBS_CCM_SOC_POWERDOWN                                      1, 2
#define CCM_OBS_M7_1_CH_POWERDOWN                                      2, 2
#define CCM_OBS_M7_2_CH_POWERDOWN                                      3, 2
#define CCM_OBS_OSC_RC_16M_CH_SILENT_N                                32, 0
#define CCM_OBS_OSC_RC_48M_CH_SILENT_N                                33, 0
#define CCM_OBS_OSC_RC_48M_DIV2_CH_SILENT_N                           34, 0
#define CCM_OBS_OSC_RC_400M_CH_SILENT_N                               35, 0
#define CCM_OBS_OSC_24M_OUT_CH_SILENT_N                               37, 0
#define CCM_OBS_PLL_ARM_OUT_CH_SILENT_N                               39, 1
#define CCM_OBS_PLL_528_OUT_CH_SILENT_N                               41, 1
#define CCM_OBS_PLL_528_PFD0_CH_SILENT_N                              42, 1
#define CCM_OBS_PLL_528_PFD1_CH_SILENT_N                              43, 1
#define CCM_OBS_PLL_528_PFD2_CH_SILENT_N                              44, 1
#define CCM_OBS_PLL_528_PFD3_CH_SILENT_N                              45, 1
#define CCM_OBS_PLL_480_OUT_CH_SILENT_N                               47, 1
#define CCM_OBS_PLL_480_DIV2_CH_SILENT_N                              48, 1
#define CCM_OBS_PLL_480_PFD0_CH_SILENT_N                              49, 1
#define CCM_OBS_PLL_480_PFD1_CH_SILENT_N                              50, 1
#define CCM_OBS_PLL_480_PFD2_CH_SILENT_N                              51, 1
#define CCM_OBS_PLL_480_PFD3_CH_SILENT_N                              52, 1
#define CCM_OBS_PLL_1G_OUT_CH_SILENT_N                                54, 1
#define CCM_OBS_PLL_1G_DIV2_CH_SILENT_N                               55, 1
#define CCM_OBS_PLL_1G_DIV5_CH_SILENT_N                               56, 1
#define CCM_OBS_PLL_AUDIO_OUT_CH_SILENT_N                             58, 0
#define CCM_OBS_PLL_VIDEO_OUT_CH_SILENT_N                             60, 1
#define CCM_OBS_CCM_SOC_OSC_RC_16M_IN_USE                             64, 2
#define CCM_OBS_CCM_SOC_OSC_RC_48M_IN_USE                             65, 2
#define CCM_OBS_CCM_SOC_OSC_RC_48M_DIV2_IN_USE                        66, 2
#define CCM_OBS_CCM_SOC_OSC_RC_400M_IN_USE                            67, 2
#define CCM_OBS_CCM_SOC_OSC_24M_OUT_IN_USE                            69, 2
#define CCM_OBS_CCM_SOC_PLL_ARM_OUT_IN_USE                            71, 2
#define CCM_OBS_CCM_SOC_PLL_528_OUT_IN_USE                            73, 2
#define CCM_OBS_CCM_SOC_PLL_528_PFD0_IN_USE                           74, 2
#define CCM_OBS_CCM_SOC_PLL_528_PFD1_IN_USE                           75, 2
#define CCM_OBS_CCM_SOC_PLL_528_PFD2_IN_USE                           76, 2
#define CCM_OBS_CCM_SOC_PLL_528_PFD3_IN_USE                           77, 2
#define CCM_OBS_CCM_SOC_PLL_480_OUT_IN_USE                            79, 2
#define CCM_OBS_CCM_SOC_PLL_480_DIV2_IN_USE                           80, 2
#define CCM_OBS_CCM_SOC_PLL_480_PFD0_IN_USE                           81, 2
#define CCM_OBS_CCM_SOC_PLL_480_PFD1_IN_USE                           82, 2
#define CCM_OBS_CCM_SOC_PLL_480_PFD2_IN_USE                           83, 2
#define CCM_OBS_CCM_SOC_PLL_480_PFD3_IN_USE                           84, 2
#define CCM_OBS_CCM_SOC_PLL_1G_OUT_IN_USE                             86, 2
#define CCM_OBS_CCM_SOC_PLL_1G_DIV2_IN_USE                            87, 2
#define CCM_OBS_CCM_SOC_PLL_1G_DIV5_IN_USE                            88, 2
#define CCM_OBS_CCM_SOC_PLL_AUDIO_OUT_IN_USE                          90, 2
#define CCM_OBS_CCM_SOC_PLL_VIDEO_OUT_IN_USE                          92, 2
#define CCM_OBS_M7_CLK_ROOT                                          128, 4
#define CCM_OBS_M4_CLK_ROOT                                          129, 0
#define CCM_OBS_BUS_CLK_ROOT                                         130, 2
#define CCM_OBS_BUS_LPSR_CLK_ROOT                                    131, 0
#define CCM_OBS_SEMC_CLK_ROOT                                        132, 2
#define CCM_OBS_CSSYS_CLK_ROOT                                       133, 2
#define CCM_OBS_CSTRACE_CLK_ROOT                                     134, 2
#define CCM_OBS_M4_SYSTICK_CLK_ROOT                                  135, 0
#define CCM_OBS_M7_SYSTICK_CLK_ROOT                                  136, 2
#define CCM_OBS_ADC1_CLK_ROOT                                        137, 2
#define CCM_OBS_ADC2_CLK_ROOT                                        138, 2
#define CCM_OBS_ACMP_CLK_ROOT                                        139, 2
#define CCM_OBS_FLEXIO1_CLK_ROOT                                     140, 2
#define CCM_OBS_FLEXIO2_CLK_ROOT                                     141, 2
#define CCM_OBS_GPT1_CLK_ROOT                                        142, 2
#define CCM_OBS_GPT2_CLK_ROOT                                        143, 2
#define CCM_OBS_GPT3_CLK_ROOT                                        144, 2
#define CCM_OBS_GPT4_CLK_ROOT                                        145, 2
#define CCM_OBS_GPT5_CLK_ROOT                                        146, 2
#define CCM_OBS_GPT6_CLK_ROOT                                        147, 2
#define CCM_OBS_FLEXSPI1_CLK_ROOT                                    148, 2
#define CCM_OBS_FLEXSPI2_CLK_ROOT                                    149, 2
#define CCM_OBS_CAN1_CLK_ROOT                                        150, 2
#define CCM_OBS_CAN2_CLK_ROOT                                        151, 2
#define CCM_OBS_CAN3_CLK_ROOT                                        152, 0
#define CCM_OBS_LPUART1_CLK_ROOT                                     153, 2
#define CCM_OBS_LPUART2_CLK_ROOT                                     154, 2
#define CCM_OBS_LPUART3_CLK_ROOT                                     155, 2
#define CCM_OBS_LPUART4_CLK_ROOT                                     156, 2
#define CCM_OBS_LPUART5_CLK_ROOT                                     157, 2
#define CCM_OBS_LPUART6_CLK_ROOT                                     158, 2
#define CCM_OBS_LPUART7_CLK_ROOT                                     159, 2
#define CCM_OBS_LPUART8_CLK_ROOT                                     160, 2
#define CCM_OBS_LPUART9_CLK_ROOT                                     161, 2
#define CCM_OBS_LPUART10_CLK_ROOT                                    162, 2
#define CCM_OBS_LPUART11_CLK_ROOT                                    163, 0
#define CCM_OBS_LPUART12_CLK_ROOT                                    164, 0
#define CCM_OBS_LPI2C1_CLK_ROOT                                      165, 2
#define CCM_OBS_LPI2C2_CLK_ROOT                                      166, 2
#define CCM_OBS_LPI2C3_CLK_ROOT                                      167, 2
#define CCM_OBS_LPI2C4_CLK_ROOT                                      168, 2
#define CCM_OBS_LPI2C5_CLK_ROOT                                      169, 0
#define CCM_OBS_LPI2C6_CLK_ROOT                                      170, 0
#define CCM_OBS_LPSPI1_CLK_ROOT                                      171, 2
#define CCM_OBS_LPSPI2_CLK_ROOT                                      172, 2
#define CCM_OBS_LPSPI3_CLK_ROOT                                      173, 2
#define CCM_OBS_LPSPI4_CLK_ROOT                                      174, 2
#define CCM_OBS_LPSPI5_CLK_ROOT                                      175, 0
#define CCM_OBS_LPSPI6_CLK_ROOT                                      176, 0
#define CCM_OBS_EMV1_CLK_ROOT                                        177, 2
#define CCM_OBS_EMV2_CLK_ROOT                                        178, 2
#define CCM_OBS_ENET1_CLK_ROOT                                       179, 2
#define CCM_OBS_ENET2_CLK_ROOT                                       180, 2
#define CCM_OBS_ENET_QOS_CLK_ROOT                                    181, 2
#define CCM_OBS_ENET_25M_CLK_ROOT                                    182, 2
#define CCM_OBS_ENET_TIMER1_CLK_ROOT                                 183, 2
#define CCM_OBS_ENET_TIMER2_CLK_ROOT                                 184, 2
#define CCM_OBS_ENET_TIMER3_CLK_ROOT                                 185, 2
#define CCM_OBS_USDHC1_CLK_ROOT                                      186, 2
#define CCM_OBS_USDHC2_CLK_ROOT                                      187, 2
#define CCM_OBS_ASRC_CLK_ROOT                                        188, 2
#define CCM_OBS_MQS_CLK_ROOT                                         189, 2
#define CCM_OBS_MIC_CLK_ROOT                                         190, 0
#define CCM_OBS_SPDIF_CLK_ROOT                                       191, 2
#define CCM_OBS_SAI1_CLK_ROOT                                        192, 2
#define CCM_OBS_SAI2_CLK_ROOT                                        193, 2
#define CCM_OBS_SAI3_CLK_ROOT                                        194, 2
#define CCM_OBS_SAI4_CLK_ROOT                                        195, 0
#define CCM_OBS_GC355_CLK_ROOT                                       196, 2
#define CCM_OBS_LCDIF_CLK_ROOT                                       197, 2
#define CCM_OBS_LCDIFV2_CLK_ROOT                                     198, 2
#define CCM_OBS_MIPI_REF_CLK_ROOT                                    199, 2
#define CCM_OBS_MIPI_ESC_CLK_ROOT                                    200, 2
#define CCM_OBS_CSI2_CLK_ROOT                                        201, 2
#define CCM_OBS_CSI2_ESC_CLK_ROOT                                    202, 2
#define CCM_OBS_CSI2_UI_CLK_ROOT                                     203, 2
#define CCM_OBS_CSI_CLK_ROOT                                         204, 2
#define CCM_OBS_CCM_CKO1_CLK_ROOT                                    205, 0
#define CCM_OBS_CCM_CKO2_CLK_ROOT                                    206, 2
#define CCM_OBS_CM7_CORE_STCLKEN                                     207, 4
#define CCM_OBS_CCM_FLEXRAM_CLK_ROOT                                 208, 4
#define CCM_OBS_MIPI_DSI_TXESC                                       209, 2
#define CCM_OBS_MIPI_DSI_RXESC                                       210, 2
#define CCM_OBS_OSC_RC_16M                                           224, 0
#define CCM_OBS_OSC_RC_48M                                           225, 0
#define CCM_OBS_OSC_RC_48M_DIV2                                      226, 0
#define CCM_OBS_OSC_RC_400M                                          227, 0
#define CCM_OBS_OSC_24M_OUT                                          229, 0
#define CCM_OBS_PLL_ARM_OUT                                          231, 2
#define CCM_OBS_PLL_528_OUT                                          233, 2
#define CCM_OBS_PLL_528_PFD0                                         234, 2
#define CCM_OBS_PLL_528_PFD1                                         235, 2
#define CCM_OBS_PLL_528_PFD2                                         236, 2
#define CCM_OBS_PLL_528_PFD3                                         237, 2
#define CCM_OBS_PLL_480_OUT                                          239, 2
#define CCM_OBS_PLL_480_DIV2                                         240, 2
#define CCM_OBS_PLL_480_PFD0                                         241, 2
#define CCM_OBS_PLL_480_PFD1                                         242, 2
#define CCM_OBS_PLL_480_PFD2                                         243, 2
#define CCM_OBS_PLL_480_PFD3                                         244, 2
#define CCM_OBS_PLL_1G_OUT                                           246, 2
#define CCM_OBS_PLL_1G_DIV2                                          247, 2
#define CCM_OBS_PLL_1G_DIV5                                          248, 2
#define CCM_OBS_PLL_AUDIO_OUT                                        250, 2
#define CCM_OBS_PLL_VIDEO_OUT                                        252, 2
#define CCM_OBS_OSC_32K                                              253, 0
#define CCM_OBS_CPU_POWER_MODE_0_0                                   256, 0
#define CCM_OBS_CPU_POWER_MODE_0_1                                   257, 0
#define CCM_OBS_CPU_MODE_TRANS_LPCG_DONE_0                           258, 0
#define CCM_OBS_CPU_MODE_TRANS_LPCG_REQUEST_0                        259, 0
#define CCM_OBS_CPU_MODE_TRANS_OSCPLL_DONE_0                         260, 0
#define CCM_OBS_CPU_MODE_TRANS_OSCPLL_REQUEST_0                      261, 0
#define CCM_OBS_CPU_POWER_MODE_1_0                                   264, 0
#define CCM_OBS_CPU_POWER_MODE_1_1                                   265, 0
#define CCM_OBS_CPU_MODE_TRANS_LPCG_DONE_1                           266, 0
#define CCM_OBS_CPU_MODE_TRANS_LPCG_REQUEST_1                        267, 0
#define CCM_OBS_CPU_MODE_TRANS_OSCPLL_DONE_1                         268, 0
#define CCM_OBS_CPU_MODE_TRANS_OSCPLL_REQUEST_1                      269, 0
#define CCM_OBS_CPU_POWER_MODE_2_0                                   272, 0
#define CCM_OBS_CPU_POWER_MODE_2_1                                   273, 0
#define CCM_OBS_CPU_MODE_TRANS_LPCG_DONE_2                           274, 0
#define CCM_OBS_CPU_MODE_TRANS_LPCG_REQUEST_2                        275, 0
#define CCM_OBS_CPU_MODE_TRANS_OSCPLL_DONE_2                         276, 0
#define CCM_OBS_CPU_MODE_TRANS_OSCPLL_REQUEST_2                      277, 0
#define CCM_OBS_CPU_POWER_MODE_3_0                                   280, 0
#define CCM_OBS_CPU_POWER_MODE_3_1                                   281, 0
#define CCM_OBS_CPU_MODE_TRANS_LPCG_DONE_3                           282, 0
#define CCM_OBS_CPU_MODE_TRANS_LPCG_REQUEST_3                        283, 0
#define CCM_OBS_CPU_MODE_TRANS_OSCPLL_DONE_3                         284, 0
#define CCM_OBS_CPU_MODE_TRANS_OSCPLL_REQUEST_3                      285, 0
#define CCM_OBS_SETPOINT_0                                           288, 0
#define CCM_OBS_SETPOINT_1                                           289, 0
#define CCM_OBS_SETPOINT_2                                           290, 0
#define CCM_OBS_SETPOINT_3                                           291, 0
#define CCM_OBS_SETPOINT_TRANS_LPCG_OFF_DONE                         292, 0
#define CCM_OBS_SETPOINT_TRANS_LPCG_OFF_REQUEST                      293, 0
#define CCM_OBS_SETPOINT_TRANS_LPCG_ON_DONE                          294, 0
#define CCM_OBS_SETPOINT_TRANS_LPCG_ON_REQUEST                       295, 0
#define CCM_OBS_STANDBY_TRANS_LPCG_IN_DONE                           296, 0
#define CCM_OBS_STANDBY_TRANS_LPCG_IN_REQUEST                        297, 0
#define CCM_OBS_STANDBY_TRANS_LPCG_OUT_DONE                          298, 0
#define CCM_OBS_STANDBY_TRANS_LPCG_OUT_REQUEST                       299, 0
#define CCM_OBS_SETPOINT_TRANS_GROUP_DOWN_DONE                       300, 0
#define CCM_OBS_SETPOINT_TRANS_GROUP_DOWN_REQUES                     301, 0
#define CCM_OBS_SETPOINT_TRANS_GROUP_UP_DONE                         302, 0
#define CCM_OBS_SETPOINT_TRANS_GROUP_UP_REQUEST                      303, 0
#define CCM_OBS_SETPOINT_TRANS_ROOT_DOWN_DONE                        304, 0
#define CCM_OBS_SETPOINT_TRANS_ROOT_DOWN_REQUEST                     305, 0
#define CCM_OBS_SETPOINT_TRANS_ROOT_UP_DONE                          306, 0
#define CCM_OBS_SETPOINT_TRANS_ROOT_UP_REQUEST                       307, 0
#define CCM_OBS_SETPOINT_TRANS_OSCPLL_OFF_DONE                       308, 0
#define CCM_OBS_SETPOINT_TRANS_OSCPLL_OFF_REQUES                     309, 0
#define CCM_OBS_SETPOINT_TRANS_OSCPLL_ON_DONE                        310, 0
#define CCM_OBS_SETPOINT_TRANS_OSCPLL_ON_REQUEST                     311, 0
#define CCM_OBS_STANDBY_TRANS_OSCPLL_IN_DONE                         312, 0
#define CCM_OBS_STANDBY_TRANS_OSCPLL_IN_REQUEST                      313, 0
#define CCM_OBS_STANDBY_TRANS_OSCPLL_OUT_DONE                        314, 0
#define CCM_OBS_STANDBY_TRANS_OSCPLL_OUT_REQUEST                     315, 0

#define CCM_OBS_DIV     3

