ARMmbed/mbed-os/targets/TARGET_NXP/TARGET_MCUXpresso_MCUS/TARGET_MIMXRT1170/drivers/fsl_clock.h
    /* GPT4 */
    kCLOCK_GPT4_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_GPT4_ClockRoot_MuxOsc24MOut = 1U,
    kCLOCK_GPT4_ClockRoot_MuxOscRc400M = 2U,
    kCLOCK_GPT4_ClockRoot_MuxOscRc16M = 3U,
    kCLOCK_GPT4_ClockRoot_MuxSysPll3Div2 = 4U,
    kCLOCK_GPT4_ClockRoot_MuxSysPll1Div5 = 5U,
    kCLOCK_GPT4_ClockRoot_MuxSysPll3Pfd2 = 6U,
    kCLOCK_GPT4_ClockRoot_MuxSysPll3Pfd3 = 7U,


    /* GPT5 */
    kCLOCK_GPT5_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_GPT5_ClockRoot_MuxOsc24MOut = 1U,
    kCLOCK_GPT5_ClockRoot_MuxOscRc400M = 2U,
    kCLOCK_GPT5_ClockRoot_MuxOscRc16M = 3U,
    kCLOCK_GPT5_ClockRoot_MuxSysPll3Div2 = 4U,
    kCLOCK_GPT5_ClockRoot_MuxSysPll1Div5 = 5U,
    kCLOCK_GPT5_ClockRoot_MuxSysPll3Pfd2 = 6U,
    kCLOCK_GPT5_ClockRoot_MuxSysPll3Pfd3 = 7U,


    /* GPT6 */
    kCLOCK_GPT6_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_GPT6_ClockRoot_MuxOsc24MOut = 1U,
    kCLOCK_GPT6_ClockRoot_MuxOscRc400M = 2U,
    kCLOCK_GPT6_ClockRoot_MuxOscRc16M = 3U,
    kCLOCK_GPT6_ClockRoot_MuxSysPll3Div2 = 4U,
    kCLOCK_GPT6_ClockRoot_MuxSysPll1Div5 = 5U,
    kCLOCK_GPT6_ClockRoot_MuxSysPll3Pfd2 = 6U,
    kCLOCK_GPT6_ClockRoot_MuxSysPll3Pfd3 = 7U,


    /* FLEXSPI1 */
    kCLOCK_FLEXSPI1_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_FLEXSPI1_ClockRoot_MuxOsc24MOut = 1U,
    kCLOCK_FLEXSPI1_ClockRoot_MuxOscRc400M = 2U,
    kCLOCK_FLEXSPI1_ClockRoot_MuxOscRc16M = 3U,
    kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll3Pfd0 = 4U,
    kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll2Out = 5U,
    kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll2Pfd2 = 6U,
    kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll3Out = 7U,


    /* FLEXSPI2 */
    kCLOCK_FLEXSPI2_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_FLEXSPI2_ClockRoot_MuxOsc24MOut = 1U,
    kCLOCK_FLEXSPI2_ClockRoot_MuxOscRc400M = 2U,
    kCLOCK_FLEXSPI2_ClockRoot_MuxOscRc16M = 3U,
    kCLOCK_FLEXSPI2_ClockRoot_MuxSysPll3Pfd0 = 4U,
    kCLOCK_FLEXSPI2_ClockRoot_MuxSysPll2Out = 5U,
    kCLOCK_FLEXSPI2_ClockRoot_MuxSysPll2Pfd2 = 6U,
    kCLOCK_FLEXSPI2_ClockRoot_MuxSysPll3Out = 7U,


    /* CAN1 */
    kCLOCK_CAN1_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_CAN1_ClockRoot_MuxOsc24MOut = 1U,
    kCLOCK_CAN1_ClockRoot_MuxOscRc400M = 2U,
    kCLOCK_CAN1_ClockRoot_MuxOscRc16M = 3U,
    kCLOCK_CAN1_ClockRoot_MuxSysPll3Div2 = 4U,
    kCLOCK_CAN1_ClockRoot_MuxSysPll1Div5 = 5U,
    kCLOCK_CAN1_ClockRoot_MuxSysPll2Out = 6U,
    kCLOCK_CAN1_ClockRoot_MuxSysPll2Pfd3 = 7U,


    /* CAN2 */
    kCLOCK_CAN2_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_CAN2_ClockRoot_MuxOsc24MOut = 1U,
    kCLOCK_CAN2_ClockRoot_MuxOscRc400M = 2U,
    kCLOCK_CAN2_ClockRoot_MuxOscRc16M = 3U,
    kCLOCK_CAN2_ClockRoot_MuxSysPll3Div2 = 4U,
    kCLOCK_CAN2_ClockRoot_MuxSysPll1Div5 = 5U,
    kCLOCK_CAN2_ClockRoot_MuxSysPll2Out = 6U,
    kCLOCK_CAN2_ClockRoot_MuxSysPll2Pfd3 = 7U,


    /* CAN3 */
    kCLOCK_CAN3_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_CAN3_ClockRoot_MuxOsc24MOut = 1U,
    kCLOCK_CAN3_ClockRoot_MuxOscRc400M = 2U,
    kCLOCK_CAN3_ClockRoot_MuxOscRc16M = 3U,
    kCLOCK_CAN3_ClockRoot_MuxSysPll3Pfd3 = 4U,
    kCLOCK_CAN3_ClockRoot_MuxSysPll3Out = 5U,
    kCLOCK_CAN3_ClockRoot_MuxSysPll2Pfd3 = 6U,
    kCLOCK_CAN3_ClockRoot_MuxSysPll1Div5 = 7U,


    /* LPUART1 */
    kCLOCK_LPUART1_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_LPUART1_ClockRoot_MuxOsc24MOut = 1U,
    kCLOCK_LPUART1_ClockRoot_MuxOscRc400M = 2U,
    kCLOCK_LPUART1_ClockRoot_MuxOscRc16M = 3U,
    kCLOCK_LPUART1_ClockRoot_MuxSysPll3Div2 = 4U,
    kCLOCK_LPUART1_ClockRoot_MuxSysPll1Div5 = 5U,
    kCLOCK_LPUART1_ClockRoot_MuxSysPll2Out = 6U,
    kCLOCK_LPUART1_ClockRoot_MuxSysPll2Pfd3 = 7U,


    /* LPUART2 */
    kCLOCK_LPUART2_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_LPUART2_ClockRoot_MuxOsc24MOut = 1U,
    kCLOCK_LPUART2_ClockRoot_MuxOscRc400M = 2U,
    kCLOCK_LPUART2_ClockRoot_MuxOscRc16M = 3U,
    kCLOCK_LPUART2_ClockRoot_MuxSysPll3Div2 = 4U,
    kCLOCK_LPUART2_ClockRoot_MuxSysPll1Div5 = 5U,
    kCLOCK_LPUART2_ClockRoot_MuxSysPll2Out = 6U,
    kCLOCK_LPUART2_ClockRoot_MuxSysPll2Pfd3 = 7U,


    /* LPUART3 */
    kCLOCK_LPUART3_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_LPUART3_ClockRoot_MuxOsc24MOut = 1U,
    kCLOCK_LPUART3_ClockRoot_MuxOscRc400M = 2U,
    kCLOCK_LPUART3_ClockRoot_MuxOscRc16M = 3U,
    kCLOCK_LPUART3_ClockRoot_MuxSysPll3Div2 = 4U,
    kCLOCK_LPUART3_ClockRoot_MuxSysPll1Div5 = 5U,
    kCLOCK_LPUART3_ClockRoot_MuxSysPll2Out = 6U,
    kCLOCK_LPUART3_ClockRoot_MuxSysPll2Pfd3 = 7U,


    /* LPUART4 */
    kCLOCK_LPUART4_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_LPUART4_ClockRoot_MuxOsc24MOut = 1U,
    kCLOCK_LPUART4_ClockRoot_MuxOscRc400M = 2U,
    kCLOCK_LPUART4_ClockRoot_MuxOscRc16M = 3U,
    kCLOCK_LPUART4_ClockRoot_MuxSysPll3Div2 = 4U,
    kCLOCK_LPUART4_ClockRoot_MuxSysPll1Div5 = 5U,
    kCLOCK_LPUART4_ClockRoot_MuxSysPll2Out = 6U,
    kCLOCK_LPUART4_ClockRoot_MuxSysPll2Pfd3 = 7U,


    /* LPUART5 */
    kCLOCK_LPUART5_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_LPUART5_ClockRoot_MuxOsc24MOut = 1U,
    kCLOCK_LPUART5_ClockRoot_MuxOscRc400M = 2U,
    kCLOCK_LPUART5_ClockRoot_MuxOscRc16M = 3U,
    kCLOCK_LPUART5_ClockRoot_MuxSysPll3Div2 = 4U,
    kCLOCK_LPUART5_ClockRoot_MuxSysPll1Div5 = 5U,
    kCLOCK_LPUART5_ClockRoot_MuxSysPll2Out = 6U,
    kCLOCK_LPUART5_ClockRoot_MuxSysPll2Pfd3 = 7U,


    /* LPUART6 */
    kCLOCK_LPUART6_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_LPUART6_ClockRoot_MuxOsc24MOut = 1U,
    kCLOCK_LPUART6_ClockRoot_MuxOscRc400M = 2U,
    kCLOCK_LPUART6_ClockRoot_MuxOscRc16M = 3U,
    kCLOCK_LPUART6_ClockRoot_MuxSysPll3Div2 = 4U,
    kCLOCK_LPUART6_ClockRoot_MuxSysPll1Div5 = 5U,
    kCLOCK_LPUART6_ClockRoot_MuxSysPll2Out = 6U,
    kCLOCK_LPUART6_ClockRoot_MuxSysPll2Pfd3 = 7U,


    /* LPUART7 */
    kCLOCK_LPUART7_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_LPUART7_ClockRoot_MuxOsc24MOut = 1U,
    kCLOCK_LPUART7_ClockRoot_MuxOscRc400M = 2U,
    kCLOCK_LPUART7_ClockRoot_MuxOscRc16M = 3U,
    kCLOCK_LPUART7_ClockRoot_MuxSysPll3Div2 = 4U,
    kCLOCK_LPUART7_ClockRoot_MuxSysPll1Div5 = 5U,
    kCLOCK_LPUART7_ClockRoot_MuxSysPll2Out = 6U,
    kCLOCK_LPUART7_ClockRoot_MuxSysPll2Pfd3 = 7U,


    /* LPUART8 */
    kCLOCK_LPUART8_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_LPUART8_ClockRoot_MuxOsc24MOut = 1U,
    kCLOCK_LPUART8_ClockRoot_MuxOscRc400M = 2U,
    kCLOCK_LPUART8_ClockRoot_MuxOscRc16M = 3U,
    kCLOCK_LPUART8_ClockRoot_MuxSysPll3Div2 = 4U,
    kCLOCK_LPUART8_ClockRoot_MuxSysPll1Div5 = 5U,
    kCLOCK_LPUART8_ClockRoot_MuxSysPll2Out = 6U,
    kCLOCK_LPUART8_ClockRoot_MuxSysPll2Pfd3 = 7U,


    /* LPUART9 */
    kCLOCK_LPUART9_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_LPUART9_ClockRoot_MuxOsc24MOut = 1U,
    kCLOCK_LPUART9_ClockRoot_MuxOscRc400M = 2U,
    kCLOCK_LPUART9_ClockRoot_MuxOscRc16M = 3U,
    kCLOCK_LPUART9_ClockRoot_MuxSysPll3Div2 = 4U,
    kCLOCK_LPUART9_ClockRoot_MuxSysPll1Div5 = 5U,
    kCLOCK_LPUART9_ClockRoot_MuxSysPll2Out = 6U,
    kCLOCK_LPUART9_ClockRoot_MuxSysPll2Pfd3 = 7U,


    /* LPUART10 */
    kCLOCK_LPUART10_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_LPUART10_ClockRoot_MuxOsc24MOut = 1U,
    kCLOCK_LPUART10_ClockRoot_MuxOscRc400M = 2U,
    kCLOCK_LPUART10_ClockRoot_MuxOscRc16M = 3U,
    kCLOCK_LPUART10_ClockRoot_MuxSysPll3Div2 = 4U,
    kCLOCK_LPUART10_ClockRoot_MuxSysPll1Div5 = 5U,
    kCLOCK_LPUART10_ClockRoot_MuxSysPll2Out = 6U,
    kCLOCK_LPUART10_ClockRoot_MuxSysPll2Pfd3 = 7U,


