ARMmbed/mbed-os/targets/TARGET_NXP/TARGET_MCUXpresso_MCUS/TARGET_MIMXRT1170/drivers/fsl_clock.h
    /* LPUART11 */
    kCLOCK_LPUART11_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_LPUART11_ClockRoot_MuxOsc24MOut = 1U,
    kCLOCK_LPUART11_ClockRoot_MuxOscRc400M = 2U,
    kCLOCK_LPUART11_ClockRoot_MuxOscRc16M = 3U,
    kCLOCK_LPUART11_ClockRoot_MuxSysPll3Pfd3 = 4U,
    kCLOCK_LPUART11_ClockRoot_MuxSysPll3Out = 5U,
    kCLOCK_LPUART11_ClockRoot_MuxSysPll2Pfd3 = 6U,
    kCLOCK_LPUART11_ClockRoot_MuxSysPll1Div5 = 7U,


    /* LPUART12 */
    kCLOCK_LPUART12_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_LPUART12_ClockRoot_MuxOsc24MOut = 1U,
    kCLOCK_LPUART12_ClockRoot_MuxOscRc400M = 2U,
    kCLOCK_LPUART12_ClockRoot_MuxOscRc16M = 3U,
    kCLOCK_LPUART12_ClockRoot_MuxSysPll3Pfd3 = 4U,
    kCLOCK_LPUART12_ClockRoot_MuxSysPll3Out = 5U,
    kCLOCK_LPUART12_ClockRoot_MuxSysPll2Pfd3 = 6U,
    kCLOCK_LPUART12_ClockRoot_MuxSysPll1Div5 = 7U,


    /* LPI2C1 */
    kCLOCK_LPI2C1_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_LPI2C1_ClockRoot_MuxOsc24MOut = 1U,
    kCLOCK_LPI2C1_ClockRoot_MuxOscRc400M = 2U,
    kCLOCK_LPI2C1_ClockRoot_MuxOscRc16M = 3U,
    kCLOCK_LPI2C1_ClockRoot_MuxSysPll3Div2 = 4U,
    kCLOCK_LPI2C1_ClockRoot_MuxSysPll1Div5 = 5U,
    kCLOCK_LPI2C1_ClockRoot_MuxSysPll2Out = 6U,
    kCLOCK_LPI2C1_ClockRoot_MuxSysPll2Pfd3 = 7U,


    /* LPI2C2 */
    kCLOCK_LPI2C2_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_LPI2C2_ClockRoot_MuxOsc24MOut = 1U,
    kCLOCK_LPI2C2_ClockRoot_MuxOscRc400M = 2U,
    kCLOCK_LPI2C2_ClockRoot_MuxOscRc16M = 3U,
    kCLOCK_LPI2C2_ClockRoot_MuxSysPll3Div2 = 4U,
    kCLOCK_LPI2C2_ClockRoot_MuxSysPll1Div5 = 5U,
    kCLOCK_LPI2C2_ClockRoot_MuxSysPll2Out = 6U,
    kCLOCK_LPI2C2_ClockRoot_MuxSysPll2Pfd3 = 7U,


    /* LPI2C3 */
    kCLOCK_LPI2C3_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_LPI2C3_ClockRoot_MuxOsc24MOut = 1U,
    kCLOCK_LPI2C3_ClockRoot_MuxOscRc400M = 2U,
    kCLOCK_LPI2C3_ClockRoot_MuxOscRc16M = 3U,
    kCLOCK_LPI2C3_ClockRoot_MuxSysPll3Div2 = 4U,
    kCLOCK_LPI2C3_ClockRoot_MuxSysPll1Div5 = 5U,
    kCLOCK_LPI2C3_ClockRoot_MuxSysPll2Out = 6U,
    kCLOCK_LPI2C3_ClockRoot_MuxSysPll2Pfd3 = 7U,


    /* LPI2C4 */
    kCLOCK_LPI2C4_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_LPI2C4_ClockRoot_MuxOsc24MOut = 1U,
    kCLOCK_LPI2C4_ClockRoot_MuxOscRc400M = 2U,
    kCLOCK_LPI2C4_ClockRoot_MuxOscRc16M = 3U,
    kCLOCK_LPI2C4_ClockRoot_MuxSysPll3Div2 = 4U,
    kCLOCK_LPI2C4_ClockRoot_MuxSysPll1Div5 = 5U,
    kCLOCK_LPI2C4_ClockRoot_MuxSysPll2Out = 6U,
    kCLOCK_LPI2C4_ClockRoot_MuxSysPll2Pfd3 = 7U,


    /* LPI2C5 */
    kCLOCK_LPI2C5_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_LPI2C5_ClockRoot_MuxOsc24MOut = 1U,
    kCLOCK_LPI2C5_ClockRoot_MuxOscRc400M = 2U,
    kCLOCK_LPI2C5_ClockRoot_MuxOscRc16M = 3U,
    kCLOCK_LPI2C5_ClockRoot_MuxSysPll3Pfd3 = 4U,
    kCLOCK_LPI2C5_ClockRoot_MuxSysPll3Out = 5U,
    kCLOCK_LPI2C5_ClockRoot_MuxSysPll2Pfd3 = 6U,
    kCLOCK_LPI2C5_ClockRoot_MuxSysPll1Div5 = 7U,


    /* LPI2C6 */
    kCLOCK_LPI2C6_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_LPI2C6_ClockRoot_MuxOsc24MOut = 1U,
    kCLOCK_LPI2C6_ClockRoot_MuxOscRc400M = 2U,
    kCLOCK_LPI2C6_ClockRoot_MuxOscRc16M = 3U,
    kCLOCK_LPI2C6_ClockRoot_MuxSysPll3Pfd3 = 4U,
    kCLOCK_LPI2C6_ClockRoot_MuxSysPll3Out = 5U,
    kCLOCK_LPI2C6_ClockRoot_MuxSysPll2Pfd3 = 6U,
    kCLOCK_LPI2C6_ClockRoot_MuxSysPll1Div5 = 7U,


    /* LPSPI1 */
    kCLOCK_LPSPI1_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_LPSPI1_ClockRoot_MuxOsc24MOut = 1U,
    kCLOCK_LPSPI1_ClockRoot_MuxOscRc400M = 2U,
    kCLOCK_LPSPI1_ClockRoot_MuxOscRc16M = 3U,
    kCLOCK_LPSPI1_ClockRoot_MuxSysPll3Pfd2 = 4U,
    kCLOCK_LPSPI1_ClockRoot_MuxSysPll1Div5 = 5U,
    kCLOCK_LPSPI1_ClockRoot_MuxSysPll2Out = 6U,
    kCLOCK_LPSPI1_ClockRoot_MuxSysPll2Pfd3 = 7U,


    /* LPSPI2 */
    kCLOCK_LPSPI2_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_LPSPI2_ClockRoot_MuxOsc24MOut = 1U,
    kCLOCK_LPSPI2_ClockRoot_MuxOscRc400M = 2U,
    kCLOCK_LPSPI2_ClockRoot_MuxOscRc16M = 3U,
    kCLOCK_LPSPI2_ClockRoot_MuxSysPll3Pfd2 = 4U,
    kCLOCK_LPSPI2_ClockRoot_MuxSysPll1Div5 = 5U,
    kCLOCK_LPSPI2_ClockRoot_MuxSysPll2Out = 6U,
    kCLOCK_LPSPI2_ClockRoot_MuxSysPll2Pfd3 = 7U,


    /* LPSPI3 */
    kCLOCK_LPSPI3_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_LPSPI3_ClockRoot_MuxOsc24MOut = 1U,
    kCLOCK_LPSPI3_ClockRoot_MuxOscRc400M = 2U,
    kCLOCK_LPSPI3_ClockRoot_MuxOscRc16M = 3U,
    kCLOCK_LPSPI3_ClockRoot_MuxSysPll3Pfd2 = 4U,
    kCLOCK_LPSPI3_ClockRoot_MuxSysPll1Div5 = 5U,
    kCLOCK_LPSPI3_ClockRoot_MuxSysPll2Out = 6U,
    kCLOCK_LPSPI3_ClockRoot_MuxSysPll2Pfd3 = 7U,


    /* LPSPI4 */
    kCLOCK_LPSPI4_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_LPSPI4_ClockRoot_MuxOsc24MOut = 1U,
    kCLOCK_LPSPI4_ClockRoot_MuxOscRc400M = 2U,
    kCLOCK_LPSPI4_ClockRoot_MuxOscRc16M = 3U,
    kCLOCK_LPSPI4_ClockRoot_MuxSysPll3Pfd2 = 4U,
    kCLOCK_LPSPI4_ClockRoot_MuxSysPll1Div5 = 5U,
    kCLOCK_LPSPI4_ClockRoot_MuxSysPll2Out = 6U,
    kCLOCK_LPSPI4_ClockRoot_MuxSysPll2Pfd3 = 7U,


    /* LPSPI5 */
    kCLOCK_LPSPI5_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_LPSPI5_ClockRoot_MuxOsc24MOut = 1U,
    kCLOCK_LPSPI5_ClockRoot_MuxOscRc400M = 2U,
    kCLOCK_LPSPI5_ClockRoot_MuxOscRc16M = 3U,
    kCLOCK_LPSPI5_ClockRoot_MuxSysPll3Pfd3 = 4U,
    kCLOCK_LPSPI5_ClockRoot_MuxSysPll3Out = 5U,
    kCLOCK_LPSPI5_ClockRoot_MuxSysPll3Pfd2 = 6U,
    kCLOCK_LPSPI5_ClockRoot_MuxSysPll1Div5 = 7U,


    /* LPSPI6 */
    kCLOCK_LPSPI6_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_LPSPI6_ClockRoot_MuxOsc24MOut = 1U,
    kCLOCK_LPSPI6_ClockRoot_MuxOscRc400M = 2U,
    kCLOCK_LPSPI6_ClockRoot_MuxOscRc16M = 3U,
    kCLOCK_LPSPI6_ClockRoot_MuxSysPll3Pfd3 = 4U,
    kCLOCK_LPSPI6_ClockRoot_MuxSysPll3Out = 5U,
    kCLOCK_LPSPI6_ClockRoot_MuxSysPll3Pfd2 = 6U,
    kCLOCK_LPSPI6_ClockRoot_MuxSysPll1Div5 = 7U,


    /* EMV1 */
    kCLOCK_EMV1_ClockRoot_MuxOscRc48MDiv2 = 0U,
    kCLOCK_EMV1_ClockRoot_MuxOsc24MOut = 1U,
    kCLOCK_EMV1_ClockRoot_MuxOscRc400M = 2U,
    kCLOCK_EMV1_ClockRoot_MuxOscRc16M = 3U,
    kCLOCK_EMV1_ClockRoot_MuxSysPll3Div2 = 4U,
    kCLOCK_EMV1_ClockRoot_MuxSysPll1Div5 = 5U,
    kCLOCK_EMV1_ClockRoot_MuxSysPll2Out = 6U,
    kCLOCK_EMV1_ClockRoot_MuxSysPll2Pfd3 = 7U,


